---
kind: method
id: M:Autodesk.Revit.UI.Plumbing.IPipeFittingAndAccessoryPressureDropUIServer.ShowSettings(Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData)
source: html/3c4b263f-22a1-27a1-8fb4-2e66aa964e8e.htm
---
# Autodesk.Revit.UI.Plumbing.IPipeFittingAndAccessoryPressureDropUIServer.ShowSettings Method

Shows the settings UI.

## Syntax (C#)
```csharp
bool ShowSettings(
	PipeFittingAndAccessoryPressureDropUIData data
)
```

## Parameters
- **data** (`Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData`) - The input data of the calculation.

## Returns
True if the user makes any changes in the UI, false otherwise.